.. _fodselsnummer_userguide:

fodselsnummer Strings
============

Introduction
------------

The function :func:`clean_no_fodselsnummer() <dataprep.clean.clean_no_fodselsnummer.clean_no_fodselsnummer>` cleans a column containing Norwegian birth number (fodselsnummer) strings, and standardizes them in a given format. The function :func:`validate_no_fodselsnummer() <dataprep.clean.clean_no_fodselsnummer.validate_no_fodselsnummer>` validates either a single fodselsnummer strings, a column of fodselsnummer strings or a DataFrame of fodselsnummer strings, returning `True` if the value is valid, and `False` otherwise.

fodselsnummer strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "15108695088"
* `standard`: fodselsnummer strings with proper whitespace in the proper places, like "151086 95088"
* `birthdate`: get the person's birthdate, like "1986-10-15".
* `gender`: get the person's birth gender ('M' or 'F').

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_no_fodselsnummer()` and `validate_no_fodselsnummer()`.

### An example dataset containing fodselsnummer strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "fodselsnummer": [
            '15108695088',
            '15108695077',
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

  fodselsnummer                                           address
0   15108695088                                     123 Pine Ave.
1   15108695077                                           main st
2   999 999 999                      1234 west main heights 57033
3     004085616                    apt 1 789 s maple rd manhattan
4   002 724 334                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_no_fodselsnummer`

By default, `clean_no_fodselsnummer` will clean fodselsnummer strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_no_fodselsnummer
clean_no_fodselsnummer(df, column = "fodselsnummer")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,151086 95088
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_no_fodselsnummer(df, column = "fodselsnummer", output_format="standard")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,151086 95088
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_no_fodselsnummer(df, column = "fodselsnummer", output_format="compact")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,15108695088
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `birthdate`

In [5]:
clean_no_fodselsnummer(df, column = "fodselsnummer", output_format="birthdate")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,1986-10-15
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `gender`

In [6]:
clean_no_fodselsnummer(df, column = "fodselsnummer", output_format="gender")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,F
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned fodselsnummer strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_no_fodselsnummer(df, column="fodselsnummer", inplace=True)

  fodselsnummer_clean                                           address
0        151086 95088                                     123 Pine Ave.
1                 NaN                                           main st
2                 NaN                      1234 west main heights 57033
3                 NaN                    apt 1 789 s maple rd manhattan
4                 NaN                robie house, 789 north main street
5                 NaN         1111 S Figueroa St, Los Angeles, CA 90015
6                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                 NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_no_fodselsnummer(df, "fodselsnummer", errors="coerce")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,151086 95088
1,15108695077,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [9]:
clean_no_fodselsnummer(df, "fodselsnummer", errors="ignore")

,fodselsnummer,address,fodselsnummer_clean
0,15108695088,123 Pine Ave.,151086 95088
1,15108695077,main st,15108695077
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_no_fodselsnummer()`

`validate_no_fodselsnummer()` returns `True` when the input is a valid fodselsnummer. Otherwise it returns `False`.

The input of `validate_no_fodselsnummer()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_no_fodselsnummer()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_no_fodselsnummer()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_no_fodselsnummer
print(validate_no_fodselsnummer("15108695088"))
print(validate_no_fodselsnummer("15108695077"))
print(validate_no_fodselsnummer("999 999 999"))
print(validate_no_fodselsnummer("51824753556"))
print(validate_no_fodselsnummer("004085616"))
print(validate_no_fodselsnummer("hello"))
print(validate_no_fodselsnummer(np.nan))
print(validate_no_fodselsnummer("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_no_fodselsnummer(df["fodselsnummer"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: fodselsnummer, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_no_fodselsnummer(df, column="fodselsnummer")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: fodselsnummer, dtype: bool

### Only DataFrame

In [13]:
validate_no_fodselsnummer(df)

   fodselsnummer  address
0           True    False
1          False    False
2          False    False
3          False    False
4          False    False
5          False    False
6          False    False
7          False    False